# Modelling Cloud Services Billing Data

**This is a mock example with tailor made data for show purposes**

We will design a Data Warehouse for a web design startup that is interested in having a dashboard or reports were startup employees can check the queries below:

* Average billing per customer
* Billing by country
* Top 10 customers
* Top 10 countries
* Billing by industry
* Billing by category
* Billing by year
* Billing by month
* billing by quarter
* average billing per industry per month
* average billing per industry per quarter
* average billing per country per quarter
* average billing per country per industry per quarter

Up to now, the client has been storing billing data in Excel Spreadsheets and wish to use a Data Warehouse to have persistent data. Also, wants to get insights using Dashboards and getting reports than will be used internally.

To get the final results, we are going to follow an ETL Workflow (Extraction, Transformation, Loading), where from an excel file, we make the necessary modifications model data suitably enough for a Data Warehouse, load data inside that DW and then create a dashboard where users can consult said queries.

## Data

The following image shows the first 5 rows of the sample data provided. Our task is to model inside a Data Warehouse. In total, it has 132,000 billing records from 2009 to 2019.

![Billing Data](../reports/figures/billing_data.png)

We will use PostgreSQL to store data coming from Spreadsheets. We will use the ERD tool provided by the PgAdmin platform to show a graphical representation of the new data model.

# Model

Before transforming data, we will model the tables will be stored.

In a Data Warehouse, modelling data uses denormalization to create snowflake schemas in which we create a fact table (containing numerical data, or facts) and dimension tables (containing categorical data). In our case, the data model is as follows:

![Data Model](../reports/figures/data_schema.png)

Let's explain step by step the model.

We identified the fact table and two dimension tables.

The fact table for the bill is modelled like this:

| Field Name   | Details                                                                        |
|--------------|--------------------------------------------------------------------------------|
| billid       | Primary key - Unique identifier for every bill                                 |
| customerid   | Foreign Key - Id of the customer                                               |
| monthid      | Foreign Key - Id of the month. We can resolve the billed month info using this |
| billedamount | Amount charged by the cloud services provided for that month in USD            |


The two dimensions are as follows.

The fields for the customer dimension are:

| Field Name | Details                                                                    |
|------------|----------------------------------------------------------------------------|
| customerid | Primary Key - Id of the customer                                           |
| category   | Category of the customer. Example: Individual or Company                   |
| country    | Country of the customer                                                    |
| industry   | Which domain/industry the customer belongs to. Example: Legal, Engineering |

As for the month dimension, is as follows:

| Field Name  | Details                                                                                 |
|-------------|-----------------------------------------------------------------------------------------|
| monthid     | Primary Key - Id of the month                                                           |
| year        | Year derived from the month field of the original data. Example: 2010                   |
| month       | Month number derived from the month field of the original data. Example: 1, 2, 3        |
| monthname   | Month name derived from the month field of the original data. Example: March            |
| quarter     | Quarter number derived from the month field of the original data. Example: 1, 2, 3, 4   |
| quartername | Quarter name derived from the month field of the original data. Example: Q1, Q2, Q3, Q4 |

# ETL

## Extraction
We now denormalize data from the Excel with Python

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('../data/raw/billingdata.xlsx')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132000 entries, 0 to 131999
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   ID                132000 non-null  int64
 1   Customer          132000 non-null  int64
 2   Billed Amount     132000 non-null  int64
 3   Category          132000 non-null  object
 4   Country           132000 non-null  object
 5   Industry          132000 non-null  object
 6   Month of Billing  132000 non-null  object
 7   Quarter           132000 non-null  int64
dtypes: int64(4), object(4)
memory usage: 8.1+ MB

This concludes the extraction stage.

## Transformation

Here, we transform data according to the schema established earlier.

### Fact Table
First, we work on the fact table.

In [3]:
ft_cols = ['ID', 'Customer', 'Month of Billing', 'Billed Amount']
# Extract fact table attributes
df_ft = df.loc[:, ft_cols]
# Rename attributes names
ft_attr = ['billid', 'customerid', 'monthid', 'billedamount']
df_ft = df_ft.rename(columns={ft_cols[i]: ft_attr[i] for i in range(len(ft_cols))})

For consistency purposes, the `monthid` should be formatted to integers in the following format that `2009/01 -> 20091`

In [4]:
df_ft.head()

   billid  customerid  monthid  billedamount
0       1           1  2009/01          5060
1       2         614  2009/01          9638
2       3         615  2009/01         11573
3       4         616  2009/01         18697
4       5         617  2009/01           944

In [5]:
def month_to_int(text):
    new_id = ''.join(map(str, [int(x) for x in text.split('/')]))
    return int(new_id)


df_ft['monthid'] = df_ft.monthid.apply(month_to_int)

In [6]:
df_ft.head()

   billid  customerid  monthid  billedamount
0       1           1    20091          5060
1       2         614    20091          9638
2       3         615    20091         11573
3       4         616    20091         18697
4       5         617    20091           944

In [7]:
df_ft.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132000 entries, 0 to 131999
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   billid        132000 non-null  int64
 1   customerid    132000 non-null  int64
 2   monthid       132000 non-null  int64
 3   billedamount  132000 non-null  int64
dtypes: int64(4)
memory usage: 4.0 MB

### Customer Dimension

Now we create the customer dimension.

In [8]:
d1_cols = ['Customer', 'Category', 'Country', 'Industry']
df_d1 = df.loc[:, d1_cols]
d1_attr = ['customerid', 'category', 'country', 'industry']
df_d1.rename(columns={d1_cols[i]: d1_attr[i] for i in range(len(d1_cols))}, inplace=True)
df_d1.drop_duplicates(inplace=True)

In [9]:
df_d1.head()

   customerid    category        country              industry
0           1  Individual      Indonesia           Engineering
1         614  Individual  United States    Product Management
2         615  Individual          China              Services
3         616  Individual         Russia            Accounting
4         617  Individual          Chile  Business Development

In [10]:
df_d1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   customerid  1000 non-null   int64
 1   category    1000 non-null   object
 2   country     1000 non-null   object
 3   industry    1000 non-null   object
dtypes: int64(1), object(3)
memory usage: 39.1+ KB

### Month Dimension

Finally, we create the month dimension. This is the trickiest dimension given that we only have two date columns (Month of Billing and Quarter), but we would like to have more detailed data and even names for months and quarters. The transformation is as follows.

In [11]:
d2_cols = ['Month of Billing', 'Quarter']
df_d2 = df.loc[:, d2_cols]
df_d2.drop_duplicates(ignore_index=True, inplace=True)
d2_attr = ['monthid', 'quarter']
df_d2.rename(columns={d2_cols[i]: d2_attr[i] for i in range(len(d2_cols))}, inplace=True)
df_d2['quartername'] = df_d2.quarter.apply(lambda x: "Q"+str(x))
df_d2['year'] = df_d2.monthid.apply(lambda x: int(x[:4]))
df_d2['month'] = df_d2.monthid.apply(lambda x: int(x[5:]))

month_names = {
    '1': 'January',
    '2': 'February',
    '3': 'March',
    '4': 'April',
    '5': 'May',
    '6': 'June',
    '7': 'July',
    '8': 'August',
    '9': 'September',
    '10': 'October',
    '11': 'November',
    '12': 'December'
}
df_d2['monthname'] = df_d2.month.apply(lambda x: month_names[str(x)])
df_d2['monthid'] = df_d2.monthid.apply(month_to_int)
df_d2 = df_d2.loc[:, ['monthid', 'year', 'month', 'monthname', 'quarter', 'quartername']]

In [12]:
df_d2.head()

   monthid  year  month monthname  quarter quartername
0    20091  2009      1   January        1          Q1
1   200910  2009     10   October        4          Q4
2   200911  2009     11  November        4          Q4
3   200912  2009     12  December        4          Q4
4    20092  2009      2  February        1          Q1

In [13]:
df_d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   monthid      132 non-null    int64
 1   year         132 non-null    int64
 2   month        132 non-null    int64
 3   monthname    132 non-null    object
 4   quarter      132 non-null    int64
 5   quartername  132 non-null    object
dtypes: int64(4), object(2)
memory usage: 6.3+ KB

## Loading

Now that we have ready all data, we insert data in the staging area of our Data Warehouse.

First we connect to Postgresql. In this scenario we use a local server, which will be different in a production environment.

In [14]:
import os

user = os.getenv('PSQL_USER')
pwrd = os.getenv('PSQL_PASS')
host = os.getenv('PSQL_HOST')
connection_postgresql = f'postgresql://{user}:{pwrd}@{host}/billingDW'

In [15]:
from sqlalchemy import create_engine, text

engine = create_engine(connection_postgresql, echo=False)

In [16]:
%load_ext sql
%sql $connection_postgresql

'Connected: mywell@billingDW'

Now that we have the connection, we first create the schema into the database.

In [17]:
%%sql
BEGIN;
DROP TABLE IF EXISTS "FactBilling";
DROP TABLE IF EXISTS "DimCustomer";
DROP TABLE IF EXISTS "DimMonth";

CREATE TABLE public."FactBilling"
(
    billid serial,
    customerid integer NOT NULL,
    monthid integer NOT NULL,
    billedamount integer NOT NULL,
    PRIMARY KEY (billid)
);

CREATE TABLE public."DimMonth"
(
    monthid integer NOT NULL,
    year integer NOT NULL,
    month integer NOT NULL,
    monthname varchar(10) NOT NULL,
    quarter integer NOT NULL,
    quartername varchar(2) NOT NULL,
    PRIMARY KEY (monthid)
);

CREATE TABLE public."DimCustomer"
(
    customerid integer NOT NULL,
    category varchar(10) NOT NULL,
    country varchar(40) NOT NULL,
    industry varchar(40) NOT NULL,
    PRIMARY KEY (customerid)
);

ALTER TABLE public."FactBilling"
    ADD FOREIGN KEY (customerid)
    REFERENCES public."DimCustomer" (customerid)
    NOT VALID;


ALTER TABLE public."FactBilling"
    ADD FOREIGN KEY (monthid)
    REFERENCES public."DimMonth" (monthid)
    NOT VALID;

END;

 * postgresql://mywell:***@txu-pi.local./billingDW
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

Once we finished, we proceed to insert data into each tables.

In [18]:
df_d1.to_sql('DimCustomer', con=engine, if_exists='append', index=False)

1000

In [19]:
df_d2.to_sql('DimMonth', con=engine, if_exists='append', index=False)

132

In [20]:
df_ft.to_sql('FactBilling', con=engine, if_exists='append', index=False)

1000

In [21]:
%sql SELECT count(*) FROM "FactBilling";

 * postgresql://mywell:***@txu-pi.local./billingDW
1 rows affected.

[(132000,)]

We are now ready to query our data from our database and make the connection inside a Database.

# Dashboard

To create the Dashboard, we use Grafana as an example. Grafana is a powerful tool to get insights from data, as it allows to connect to several sources and also offers a cloud solution.

To ease the querying in Grafana, we create several Materialized Views to answers the queries of interest. Materialized Views allow to query data faster than normal for certain queries, which in some cases is an advantage by using it in a Data Warehouse.

## Preview

![Dashboard Preview](../reports/figures/dashboard.png)

## Final Remarks

In this notebook we showed a small example of how would be an ETL workflow to take Excel data into a Data Warehouse and then show results in a Dashboard aimed for the final user.

## Dashboard queries

Average billing per customer

In [22]:
%%sql
SELECT f.customerid, AVG(billedamount) as avg_billing
FROM "FactBilling" f, "DimCustomer" d1
WHERE f.customerid = d1.customerid
GROUP BY f.customerid
ORDER BY f.customerid
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[(1, Decimal('10096.250000000000')),
 (2, Decimal('9885.9318181818181818')),
 (3, Decimal('9966.8409090909090909')),
 (4, Decimal('9801.7727272727272727')),
 (5, Decimal('10440.916666666667')),
 (6, Decimal('10639.984848484848')),
 (7, Decimal('9501.7803030303030303')),
 (8, Decimal('9888.6893939393939394')),
 (9, Decimal('10168.037878787879')),
 (10, Decimal('10607.234848484848'))]

For some queries can be solved using a materialized view

In [23]:
%%sql
SELECT f.customerid, country, industry, category
FROM "FactBilling" f, "DimCustomer" d1
WHERE f.customerid = d1.customerid
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[(1, 'Indonesia', 'Engineering', 'Individual'),
 (614, 'United States', 'Product Management', 'Individual'),
 (615, 'China', 'Services', 'Individual'),
 (616, 'Russia', 'Accounting', 'Individual'),
 (617, 'Chile', 'Business Development', 'Individual'),
 (618, 'Nicaragua', 'Human Resources', 'Individual'),
 (41, 'Brazil', 'Marketing', 'Company'),
 (619, 'Russia', 'Business Development', 'Individual'),
 (620, 'China', 'Business Development', 'Individual'),
 (956, 'Peru', 'Research and Development', 'Individual')]

Billing by country

In [24]:
%%sql
SELECT country, SUM(billedamount) AS total_bill
FROM "FactBilling" f, "DimCustomer" d1
WHERE f.customerid = d1.customerid
GROUP BY country
ORDER BY total_bill desc
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[('China', 240730849),
 ('Indonesia', 131472998),
 ('Russia', 76482870),
 ('Philippines', 70216412),
 ('Portugal', 50006318),
 ('Brazil', 46104537),
 ('France', 40040853),
 ('Poland', 37618955),
 ('Sweden', 34688658),
 ('United States', 31954615)]

Top 10 customers

In [25]:
%%sql
SELECT customerid, SUM(billedamount) AS total_bill
FROM "FactBilling"
GROUP BY customerid
ORDER BY total_bill desc
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[(884, 1582659),
 (638, 1516731),
 (375, 1507187),
 (456, 1506858),
 (831, 1504771),
 (926, 1503772),
 (938, 1501471),
 (963, 1495367),
 (815, 1492014),
 (45, 1491392)]

Top 10 countries

In [26]:
%%sql
SELECT country, SUM(billedamount) AS total_bill
FROM "FactBilling" f, "DimCustomer" d1
WHERE f.customerid = d1.customerid
GROUP BY country
ORDER BY total_bill desc
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[('China', 240730849),
 ('Indonesia', 131472998),
 ('Russia', 76482870),
 ('Philippines', 70216412),
 ('Portugal', 50006318),
 ('Brazil', 46104537),
 ('France', 40040853),
 ('Poland', 37618955),
 ('Sweden', 34688658),
 ('United States', 31954615)]

Billing by industry

In [27]:
%%sql
SELECT industry, SUM(billedamount) AS total_bill
FROM "FactBilling" f, "DimCustomer" d1
WHERE f.customerid = d1.customerid
GROUP BY industry
ORDER BY total_bill desc
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[('Legal', 119663118),
 ('Training', 119505726),
 ('Engineering', 119438439),
 ('Marketing', 117918261),
 ('Research and Development', 112563301),
 ('Product Management', 110646530),
 ('Services', 109674429),
 ('Sales', 108467931),
 ('Human Resources', 108076401),
 ('Business Development', 108017408)]

Billing by category

In [28]:
%%sql
SELECT category, SUM(billedamount) AS total_bill
FROM "FactBilling" f, "DimCustomer" d1
WHERE f.customerid = d1.customerid
GROUP BY category
ORDER BY total_bill desc
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
2 rows affected.

[('Individual', 672775216), ('Company', 647445529)]


Billing by year

In [29]:
%%sql
SELECT year, SUM(billedamount) AS total_bill
FROM "FactBilling" f, "DimMonth" d2
WHERE f.monthid = d2.monthid
GROUP BY year
ORDER BY total_bill desc
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[(2013, 120859328),
 (2019, 120820495),
 (2012, 120761543),
 (2016, 120433289),
 (2009, 120263327),
 (2015, 119808719),
 (2018, 119595980),
 (2017, 119526654),
 (2010, 119484658),
 (2011, 119427469)]




Billing by month

In [30]:
%%sql
SELECT month, SUM(billedamount) AS total_bill
FROM "FactBilling" f, "DimMonth" d2
WHERE f.monthid = d2.monthid
GROUP BY month
ORDER BY month;

 * postgresql://mywell:***@txu-pi.local./billingDW
12 rows affected.

[(1, 110097877),
 (2, 110023410),
 (3, 109805178),
 (4, 109675477),
 (5, 110277191),
 (6, 110368836),
 (7, 110461546),
 (8, 110592841),
 (9, 109937478),
 (10, 109490307),
 (11, 109798817),
 (12, 109691787)]

billing by quarter

In [31]:
%%sql
SELECT quartername, SUM(billedamount) AS total_bill
FROM "FactBilling" f, "DimMonth" d2
WHERE f.monthid = d2.monthid
GROUP BY quartername
ORDER BY quartername;

 * postgresql://mywell:***@txu-pi.local./billingDW
4 rows affected.

[('Q1', 329926465), ('Q2', 330321504), ('Q3', 330991865), ('Q4', 328980911)]


average billing per industry per month

In [32]:
%%sql
SELECT industry, month, AVG(billedamount) AS avg_bill
FROM "FactBilling" f, "DimCustomer" d1, "DimMonth" d2
WHERE f.customerid = d1.customerid
AND f.monthid = d2.monthid
GROUP BY industry, month
ORDER BY industry, month
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[('Accounting', 1, Decimal('10022.435549525102')),
 ('Accounting', 2, Decimal('9705.5915875169606513')),
 ('Accounting', 3, Decimal('9880.9294436906377205')),
 ('Accounting', 4, Decimal('9828.1465400271370421')),
 ('Accounting', 5, Decimal('9914.9253731343283582')),
 ('Accounting', 6, Decimal('10208.877883310719')),
 ('Accounting', 7, Decimal('10255.754409769335')),
 ('Accounting', 8, Decimal('9807.1913161465400271')),
 ('Accounting', 9, Decimal('10146.207598371777')),
 ('Accounting', 10, Decimal('10111.009497964722'))]


average billing per industry per quarter

In [33]:
%%sql
SELECT industry, quartername, AVG(billedamount) AS avg_bill
FROM "FactBilling" f, "DimCustomer" d1, "DimMonth" d2
WHERE f.customerid = d1.customerid
AND f.monthid = d2.monthid
GROUP BY industry, quartername
ORDER BY industry, quartername
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[('Accounting', 'Q1', Decimal('9869.6521935775667119')),
 ('Accounting', 'Q2', Decimal('9983.9832654907281773')),
 ('Accounting', 'Q3', Decimal('10069.717774762551')),
 ('Accounting', 'Q4', Decimal('10039.921302578019')),
 ('Business Development', 'Q1', Decimal('9976.9726533628972653')),
 ('Business Development', 'Q2', Decimal('10123.834441980783')),
 ('Business Development', 'Q3', Decimal('9920.7771618625277162')),
 ('Business Development', 'Q4', Decimal('9896.1570583887657058')),
 ('Engineering', 'Q1', Decimal('10066.024242424242')),
 ('Engineering', 'Q2', Decimal('9979.1023569023569024'))]


average billing per country per quarter

In [34]:
%%sql
SELECT country, quartername, AVG(billedamount) AS avg_bill
FROM "FactBilling" f, "DimCustomer" d1, "DimMonth" d2
WHERE f.customerid = d1.customerid
AND f.monthid = d2.monthid
GROUP BY country, quartername
ORDER BY country, quartername
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[('Afghanistan', 'Q1', Decimal('9859.3636363636363636')),
 ('Afghanistan', 'Q2', Decimal('10295.7575757575757576')),
 ('Afghanistan', 'Q3', Decimal('9963.3030303030303030')),
 ('Afghanistan', 'Q4', Decimal('9951.7575757575757576')),
 ('Albania', 'Q1', Decimal('9297.6515151515151515')),
 ('Albania', 'Q2', Decimal('9910.5909090909090909')),
 ('Albania', 'Q3', Decimal('9297.9343434343434343')),
 ('Albania', 'Q4', Decimal('9423.8181818181818182')),
 ('American Samoa', 'Q1', Decimal('8367.2121212121212121')),
 ('American Samoa', 'Q2', Decimal('9751.1363636363636364'))]


average billing per country per industry per quarter

In [35]:
%%sql
SELECT country, industry, quartername, AVG(billedamount) AS avg_bill
FROM "FactBilling" f, "DimCustomer" d1, "DimMonth" d2
WHERE f.customerid = d1.customerid
AND f.monthid = d2.monthid
GROUP BY country, industry, quartername
ORDER BY country, industry, quartername
LIMIT 10;

 * postgresql://mywell:***@txu-pi.local./billingDW
10 rows affected.

[('Afghanistan', 'Product Management', 'Q1', Decimal('9859.3636363636363636')),
 ('Afghanistan', 'Product Management', 'Q2', Decimal('10295.7575757575757576')),
 ('Afghanistan', 'Product Management', 'Q3', Decimal('9963.3030303030303030')),
 ('Afghanistan', 'Product Management', 'Q4', Decimal('9951.7575757575757576')),
 ('Albania', 'Accounting', 'Q1', Decimal('9589.2727272727272727')),
 ('Albania', 'Accounting', 'Q2', Decimal('9806.2424242424242424')),
 ('Albania', 'Accounting', 'Q3', Decimal('8944.4545454545454545')),
 ('Albania', 'Accounting', 'Q4', Decimal('9527.6060606060606061')),
 ('Albania', 'Engineering', 'Q1', Decimal('8460.9848484848484848')),
 ('Albania', 'Engineering', 'Q2', Decimal('9936.4242424242424242'))]